# 2 - Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# *Пример:*

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

list = [2, 3, 4, 4, 5, 6]
n = 0

while n < len(list)//2:
    sum = list[n] * list[-n-1]
    n += 1
    print(sum)